[
    {
        "heading" : "Divorce Lawyers",
        "image" : "./img/divorceLawyer.jpg",
        "text" : "<p>Our Markovski office has divorce attorneys available to people. All of them for one reason or another may need advice depending on what the particular situation is with their marital life. The divorce procedure between a man and a woman in the country is governed by the new Family Code, as well as by the Civil Procedure Code. Once the new Family Code has made some changes to the divorce proceedings some time ago, the so-called conciliation session is being dropped. It has, to a greater or lesser extent, led to delaying divorce cases. In the case of divorce by mutual consent, the requirement to have a minimum of three years of marriage has been removed. This actually means that the next day after a civil marriage, the spouses can demand a divorce.</p><p>Divorce due to marital disorder or divorce by mutual consent are the two traditional cases from which the interested in the services of divorce lawyers can choose. In each of the two situations there is no doubt a disruption of the marriage, but in the first case the court examines and pronounces the spouses' guilt. With regard to the emergence of the second case, then the divorced spouses have already settled all the necessary formalities between themselves or at least that part of it for which the divorce settlement is obligatory. Then the court should only act as the approver of the agreement between the two, and at the same time it should be monitoring whether it does not interfere in any way with the law. In the area of ​​divorce cases, cases are occasionally exceptional, which are better known as 'private cases'. For example, the spouse who is the plaintiff could ask the court not to rule on the issue of guilt, which includes the reasons for the divorce. This case is specific in situations where both spouses are not in litigation, but at the same time one party stubbornly postpones the commencement of the case.</p><p>Every lawyer in divorce lawsuits from Markovski law firm is available to people who need specific advice and help. Another characteristic feature of this type of case is the drafting of a divorce agreement between the spouses. It should include several mandatory applications. The inclusion of such agreements and clauses, which are generally not mandatory, are also sometimes required. Among the divorce documents, first of all, it is necessary to submit the application for divorce, as well as an attached copy of the marriage certificate. In the case of a copy, the court gives the opportunity the original of this document to be presented. Given that the married couple has underage children, their birth certificates should also be presented. The set of documents for statistical purposes is also among the things to be presented. Such purposes are not required, but this leads to an acceleration of the process.</p>"
    },
    {
        "heading" : "Trade Law Lawyers",
        "image" : "./img/corporateLawyer.jpg",
        "text" : "<p>Anyone who needs a lawyer in Trade law can contact our Markovski office. We offer our services to all people, regardless of where they live. In general, Trade law is considered to be a branch of civil law and is in essence a system of norms. They regulate the legal status of all those people who engage in a certain type of trade. Last but not least, this part of the law is the regulator of the relationships in which traders always enter in the course of their business. Traders or so-called business entities are one of the subjects of regulation of this share of law. It governs their legal capacity, legal personalization and organization. Secondly, there are commercial relationships that arise on the basis of the rule of law. This, in turn, is based on legal facts and obligations that consist of commercial rights. </p><p>Relationships are of asset-legal nature, so at least one of the two sides is required to be a trader. In the case of a direct relationship between two traders, commercial relationships arise. However, if the trader is only one of the two parties, then the relations that have arisen are unilateral. The use of a commercial lawyer may be required whenever a dispute between traders or a joint contract has to be settled. Important are the principles that apply and thanks to which the branch continues to develop in our days. The first principle is that of the legal autonomy and autonomy of individuals. The equality of individuals is followed by the subjects being entitled to the same conditions in order to exercise their rights. The equivalent nature of trade relations means that all goods and services must be paid. The last and fourth principle of Trade law is called freedom of competition and the prohibition of unfair competition. Each of them is important and needs to be well-known by traders. All such people can use the services of our law firm, which has specialists in different legal areas.</p><p>When employing a trade law attorney, many other questions may arise from people, for example related to his/her sources and subjects. In both cases, there are important things to know. The traders and non-traders are the subjects of this part of the law. The trader is a participant in the trade turnover whose main status and activities are subject to a special regime. He also combines the three basic requirements, which are to be a legal entity or natural person, to carry out some of the transactions listed in the Trade Law and to do this professionally. The Trade Law, the Law on Protection of Competition, the Law on Banks and Credit, and many others are the sources for the Trade law. As far as trade is concerned, it is not a legal concept. It mainly covers commodity-related monetary relations in a society, such as the exchange of labor products.</p>"
    },
    {
        "heading" : "Legal Advice",
        "image" : "./img/legalAdvice.jpg",
        "text" : "<p>Providing legal advice is something that many people need. Whether they are related to divorce or commercial activities, our Markovski office is always available. We work every day and offer our services to people from all over the country. Nowadays, without the advice and recommendations of lawyers, there is a huge likelihood of making mistakes, leading to irregularities or even unintentional violations of laws. This is done by people mainly because of the lack of sufficient experience and knowledge in the field of legal rights. Given the fact that it is possible today to consult with a lawyer and provide legal assistance online, Clients are guaranteed a connection at a convenient time. Regardless of the nature of the issues, their rigorous and careful discussion is key to winning a case or for making a more profitable trade agreement.</p><p>A lot of legal services are offered by the Markovski's office and they extend to different areas of law. In case of need for advice on compensation for traffic accidents, divorce problems or commercial contracts, each of our clients is welcome. Our specialists answer in detail to questions, which in turn allows those interested to learn all the things they want to know. Many of the questions we receive are in fact complex in character and, as a result, incomprehensible to humans. Questions can cover different aspects that require the study of documents, appendices and any other important written agreements. The clauses in the conclusion of a contract may sometimes be many, and this is always associated with the risk of their poor reading or misunderstanding on the part of the people. Hardly anyone wants to get into the worst situation, which leads to an unintentional violation of the law or to the compelling need to pay a certain amount as compensation for damages. It is for this reason that anyone who needs advice in the field of law should not hesitate to ask us.</p><p>Discussing the various legal issues is an essential and integral part of the everyday life of our law firm, Markovski. Anyone can make an appointment and discuss their casework by arranging a meeting or online by using an email address to contact. In this case, filling in the relevant form and entering all requested data is required so that feedback can be provided. Often, questions may be less important, but this does not mean they should not be discussed with a professional attorney. That's why we are always available to people, no matter what their particular case is. Only when case details are provided it is possible to find a good and promising solution for our trustworthy clients. All of them can use the services of our attorneys working in the office.</p>"
    },
    {
        "heading" : "General Directorate of Security",
        "image" : "./img/genDirSecurity.jpg",
        "text" : "<p>The General Directorate of Security is a legal entity with the Minister of Justice. Its headquarters are located on the territory of the capital of the country - Sofia. It also fulfills the role of subordinate type spender with budget appropriations. The Directorate's main task is to carry out the activities related to the security of the bodies of the judiciary. In this respect, first of all, the organization and implementation of the security of the bodies in the structure of the judiciary is involved. Ensuring order and discipline in the court buildings and ensuring the security of the judiciary authorities at the time when the latter exercise their powers. The security of judges, prosecutors, investigators and other senior officials is another of the functions that this security directorate must perform strictly and consistently. Providing assistance to the judiciary authorities in summoning persons after exhaustion of all other means, as well as the state executors, is another function of the judiciary.</p><p>The function is carried out in accordance with Article 178 (1) of the Code of Criminal Procedure. In the case of a decree by a body of the judiciary, the obligations of the General Directorate of Security also include the forced bringing of persons to the same authorities, usually in the process of criminal law. The sixth consecutive function relates to the safeguarding and convoying of persons who are accused or of those for whom the detention pending trial is being or is already in place. For the first time in 2002, the functions and responsibilities that this Directorate has to fulfill are defined. By a decree, specially issued by the Council of Ministers - the Directorate, which is now functioning in its present form, has been formally established. Pursuant to the requirements set out in Chapter Justice and Home Affairs, the organization is directly under the command and control of the Justice Minister. The number of people working in the Directorate has increased significantly over the years, its official functioning began in March 2003. Six years later, in 2009, some changes were adopted. These concern the Judiciary Act, which results in the Directorate acquiring the status of a legal entity and a subordinate authorizing officer with the Minister of Justice. This is officially confirmed under Article 391, para. 2.</p><p>Regulations for the structure and activity of the General Directorate of Security were drafted precisely by the aforementioned law, as it is officially approved by the Ministry of Justice. The powers of the Law on the Ministry of Internal Affairs staff increase significantly, while at the same time increasing the forms and methods of impact on the offenders and the court buildings in the performance of the duties at the time of summoning, forced bringing in persons or in case of their convoying. Performing inspections and monitoring compliance with safety and security rules and standards are one of the key responsibilities of the Directorate that are key to its functioning. The prosecutor's orders to enforce prison sentences that have already entered into force must be strictly enforced by the Directorate - this is one more of her basic duties. The Ministry of Internal Affairs, in turn, is the body that sends instructions to its directors about its activities.</p>"
    },
    {
        "heading" : "Lawyer Exams",
        "image" : "./img/lawyerExams.jpg",
        "text" : "<p>Exams for lawyers is an event that takes place every year. It has traditionally been the people who have decided to study law and subsequently devote their lives to it. Depending on the direction they want to develop later, those attending these exams are prepared for them on the basis of a specially prepared syllabus. It consists of a number of topics and questions that might eventually be part of the exams. We at Markovski Lawyers give a chance to young lawyers, and we often organize internship programs. Each year, the syllabus undergoes changes and, in addition, the respondents have the opportunity to prepare themselves on pre-made sample tests. They are generally available online for everyone, so they only need to be downloaded from relevant sources. These exams help not only to enter the lawyer's profession but also give some the chance to work as a junior lawyer or other senior positions. Exams are held in different locations across the country because there are many functioning lawyer associations.</p><p>Exemplary tests and case studies can prove to be extremely useful for all those who have to appear on different lawyers' exams. As in any other specialty, tests are usually made on the basis of the material studied. It is quite natural for the exam not to have exactly the same questions as the ones from the sample tests. However, this can happen to some of them, so those who have previously done them have all the chances of going through them successfully. Not everyone, however, is allowed to take such exams, especially if they relate to a higher position in the future. For example, one of the determining factors in this direction is the presence of sufficiently high success, and those with lower ratings are not allowed to take the exam. Seminars and training courses are another important aspect related to the successful passing of exams. These are held in different locations across the country during the year, and they are generally available to everyone. The practical and theoretical activities of the seminars provide a good basis for learning the subtleties of the lawyer's profession and its different strands.</p><p>On the territory of the capital city of Sofia and some other cities the aforementioned seminars are regularly held, their terms usually come out in advance and thus become accessible to all those who are interested. To make all lawyer examinations successful, there is no doubt that more than good preparation is required. It encompasses not only theoretical knowledge, but also other subtleties. The Superior Bar Council is usually the authority that informs those wishing to take junior lawyers' exams about any changes to their syllabus or about a pre-program for seminars. These and many other things are undoubtedly of interest to those interested in working with the law. Today, this is a profession that gives a wide scope for expression and allows everyone to become the kind of lawyer they want to be. In addition to criminal law, trade, civil and many other types of law can be practiced.</p>"
    },
    {
        "heading" : "Prosecutor",
        "image" : "./img/common.jpg",
        "text" : "<p>The prosecutor is, by its very nature, one of the most important positions in the field of law. This is the person who is the principal legal representative of the prosecution and at the same time performs the functions of a prosecutor's agent. In each case, the prosecutor plays the role of a party responsible for presenting a criminal case against a person who has been charged with violating laws often in need of Bulgarian legal services. In countries that have a fully-fledged criminal trial, the prosecutor has the character of a countrywide lawyer. The Racing Criminal Code has another name, which is probably better known to the general public. This is an Anglo-Saxon legal system that has long been established in the country and many other countries around the world. In principle, the prosecutor always defends the interests of society by basing his defense on the basis of the powers granted to him by the legislative regulation. The constitution of the respective state is the body that regulates all rights, duties and subsequent responsibilities of prosecutors.</p><p>Especially in the modern constitution of the country, the prosecutor's office acts as a central and independent body. The Supreme Judicial Council is the body that has the task of electing a prosecutor for a period of seven years. It is better known as the SJC and is one of the bodies of immense importance for the law. The role of all Chief Prosecutors is very significant regardless of which country it is concerned with. This is primarily due to the supervision and management of all prosecutors in the country. Last but not least, this post is also a member of the already mentioned Supreme Judicial Council. The Chief Prosecutor's Office assists in his activities while at the same time leading the state that has elected him to take up this post. The Chief Prosecutor's Office was established for the first time since 1947 when our country adopted the famous Dimitrov Constitution. Until then, all prosecutors served only the courts. A new constitution, adopted in 1991, somewhat amends and takes some of the prosecutor's powers. By contrast, however, its independence is greatly increased. While the Dimitrov Constitution granted him a five-year mandate, the new one from 1991 grants him seven-year mandate.</p><p>The primary duty of each prosecutor is to monitor and distribute the work of his deputies, and the Chief Prosecutor to exercise direct supervision of the prosecutor's office. As far as the employees of the Supreme Cassation Prosecutor's Office are concerned, they also depend to a large extent on the Chief Prosecutor. It is he who decides which of them to appoint and how much to break the commitments at the moment. At the suggestion of the Supreme Judicial Council in 1991, the President, our state head, is the one who appoints the prosecutor of the country. In addition to assisting the Supreme Cassation Prosecutor's Office and, in particular, its employees, the Public Prosecutor may also entrust them with his powers. An exception may be made in this case only if the law provides otherwise. The Chief Prosecutor has the right to make revisions to other prosecutors by doing it personally or through trusted people.</p>"
    },
    {
        "heading" : "Sofia Bar Association",
        "image" : "./img/sofiaBarAssoc.jpg",
        "text" : "<p>One of the first advocacy councils for the country is the Sofia Bar Association, better known as the SBA. It was established on 11.10.1897 at the initiative of the President of the Sofia Regional Court Georgi Pisarev. Dimitar Grekov is the first chairman of the organization, and he is among our famous post-liberation politicians. The setting up of a precise list of all lawyers included in the Sofia District Court is the first and foremost task assigned to the SBA immediately after its formal establishment. But as to when his real development began, the exact year was 1925. Then, on 24 August, the Law on Attorneys, which builds the principles of the native law of self-government and control, is established. Later on 16 October 1947, a second law on lawyers was adopted. According to it, the Bar Associations acquire the status of legal entities engaged in legal services with bodies of general assembly and Bar Council. The Justice Minister is beginning to play an increasingly important role in this body, especially in the years after 1976.</p><p>Then the rights of the Minister are not only preserved, but also marked a significant extension. On September 12, 1991, another law was adopted by the Grand National Assembly. It repealed the 1976 law and ruled that the legal profession takes the form of a constitutional action for legal assistance and protection of rights, laws and freedoms and interests of all legal entities and individuals. This law is in force until the entry into force of the new Bar Law, which was formally adopted on June 10, 2004. The Chairman, Secretary and Deputy Chairperson are the three main positions in the SBA ranks.</p>"
    },
    {
        "heading" : "Sofia Bar Council",
        "image" : "./img/sofiaBarCouncil.jpg",
        "text" : "<p>The Sofia Court of Appeal is better known as SCA and its law enforcement activity covers approximately half of civil, criminal and commercial cases. For their part, they are dealt with before the appellate courts. Eight of these are the District Courts, covered by the jurisdiction of the SCA. That includes Blagoevgrad, Vratsa, Vidin, Kyustendil, Montana District Court, Sofia, Pernik Regional Court, as well as the largest one on the territory of the country. This is the Sofia City Court, and as far as the initial creation of SCA is concerned, it officially functions as of 01.04.1998. Depending on the type of cases they are dealing with, the SCA judges are divided into wards. At present, the number of judges in this organization reaches 58 and the number of judicial staff is 63.</p>"
    },
    {
        "heading" : "Legal Professionals",
        "image" : "./img/common.jpg",
        "text" : "<p>The legal profession is exercised by all people, whether men or women, who are engaged in a professional career by practicing the law. Today, there is usually a basic requirement for people who want to dedicate their lives to legal science. It consists of completing the legal education that is available in a large number of higher education institutions, better known as universities. Last but not least, the acquisition of legal capacity registration is required. There are several basic professions that are directly related to the law. These are, for example, judges, prosecutors, investigators, lawyers and many others. This includes those who are scientifically or practically involved with law. Nowadays, lawyers are offered a wide range of job opportunities depending on their specific interests. While some people turn to the profession of lawyer-consultant, others prefer to specialize in a particular area of ​​law. These are, for example, divorce, criminal or commercial law.</p><p>Every lawyer can work in his/her profession in different places, not necessarily just law firms. Today, a lot of companies are dealing with different types of business. All of them are undoubtedly in need of the services of a person who has acquired legal capacity and can take over all the company's affairs. As for the other options for the people who have chosen law for their profession, many of them subsequently become notaries. This profession has long been established and, moreover, very important, because the certification of documents and the issuance of acts accompany many of the activities in our daily lives. One of the newest and most active law organizations is Jurist Club, founded in April 2014. The main purpose of this organization is to activate all young people who have decided to dedicate their lives to the law.</p>"
    },
    {
        "heading" : "Public defender",
        "image" : "./img/freeLegalHelp.jpg",
        "text" : "<p>Hiring a public defender is something that many people do these days. The reasons for this may be of a diverse nature, the most common being the lack of sufficient financial resources. In this situation, there are several possibilities for people and, depending on their objective judgment, they decide which option to choose. As a rule, the law on barristers states that every lawyer is entitled to monetary reward for his efforts in the course of the proceedings. As far as the amount of the fee is concerned, its value is determined by a contract for legal aid with the client. At the same time, the value of the remuneration can not in any circumstances be below the threshold laid down in Ordinance 1 on minimum rates of attorney's fees. It has been officially operational since July 9, 2004, and its official publisher is the Supreme Bar Council. This is one of the most important legal bodies in the country.</p><p>The lawyer has the right to help for free in some limited cases. For example, having the right to a public defender are dependent people along with those who have serious material difficulties. Their relatives are also among the people who have the right to use the services of their legal professional cheaper. However, this provision is generally rarely applied in practice. At that point, attention is usually drawn to the Law on Legal Aid which comes into effect and which aims to provide adequate protection for poor people. Under it, legal aid can be provided in civil, administrative and criminal proceedings. It is carried out by lawyers, and the financial side of the matter is settled by the state. The equality of the parties in the process should at all costs be guaranteed by free assistance. There is another important fact in this case, which is essential. Such aid may be claimed and subsequently may be provided only to a natural person. Several are the main legal aids that people often resort to and have already established themselves as a common law steps.</p><p>Counseling with the goal of reaching an agreement before the commencement of proceedings or filing a case is one of the cases. The second is the case with the preparation of the documents necessary for the filing of the case. Prosecution and representation on detention by customs or police authorities are two of the cases where legal aid can be sought. In order to seek the assistance of a public defender, it is necessary to send a request to the relevant authority. In addition, the applicant for such a service must meet the requirements set out in the law. The National Bureau for Legal Aid is the body to which such requests are made. As for who should do such an action, it is precisely the person in need of the help for a lawyer to deal with this task. It is still necessary for candidates to qualify for social welfare benefits and to be placed in a specialized in offering social services institution.</p>"
    }
]
